DataProcessors/ГенераторПаролей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ГенераторПаролей</Name>
			<Comment>NNS</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаПароля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквыВерхнийРегистр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквыНижнийРегистр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспСпецСимволы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспЦифры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПаролей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеиспользуемыеСимволы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецСимволы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ГенераторПаролей/Forms/ФормаУФ/Ext/Form/Module.bsl
//NNS

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоПаролей = 1;
	ДлинаПароля = 8;
	БуквыНижнийРегистр = Истина;
	БуквыВерхнийРегистр = Истина;
	ИспЦифры = Истина;
	ИспСпецСимволы = Истина;
	СпецСимволы = "_.,!?@#$%^&*()+|\/№;:-=~[]";
КонецПроцедуры

&НаКлиенте
Процедура Генерация(Команда)
	
	Если БуквыНижнийРегистр Тогда
		БуквыСтрочные = "abcdefghiklmnopqrstvxyz";
	Иначе	
		БуквыСтрочные = "";
	КонецЕсли;	
	Если БуквыВерхнийРегистр Тогда
		БуквыЗаглавные = "ABCDEFGHIKLMNOPQRSTVXYZ";
	Иначе	
		БуквыЗаглавные = "";
	КонецЕсли;	
	Если ИспЦифры Тогда
		Цифры = "0123456789";
	Иначе	
		Цифры = "";
	КонецЕсли;	
	Если ИспСпецСимволы Тогда
		СпСм = СпецСимволы;
	Иначе	
		СпСм = "";
	КонецЕсли;
	
	ВсяСтрока = Цифры + БуквыЗаглавные + БуквыСтрочные + СпСм;
	Вгр = 0;
	Нгр = 0;
	ПолучитьВерхнююИНижнююГраницуСимволов(ВсяСтрока, Вгр, Нгр);
	
	Для Номер = 1 По КоличествоПаролей Цикл
		ГенерируемыеПароли.Добавить(ГенерацияПароля(ВсяСтрока, Вгр, Нгр));
	КонецЦикла;	
	        
КонецПроцедуры

&НаСервере
Функция ГенерацияПароля(ВсяСтрока, Вгр, Нгр)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ГенПароль = "";
	Пока СтрДлина(ГенПароль) < ДлинаПароля Цикл
		НекийСимвол = Символ(ГСЧ.СлучайноеЧисло(Нгр, Вгр));			
		Если Найти(НеиспользуемыеСимволы, НекийСимвол) > 0 ИЛИ НЕ Найти(ВсяСтрока, НекийСимвол) > 0 Тогда
			Продолжить;
		КонецЕсли;
		ГенПароль = ГенПароль + НекийСимвол;
	КонецЦикла;
	Возврат ГенПароль
КонецФункции

&НаСервере
Процедура ПолучитьВерхнююИНижнююГраницуСимволов(ВсяСтрока, Вгр, Нгр)
	Для НомерСимвола = 1 По СтрДлина(ВсяСтрока) Цикл
		Символ = Сред(ВсяСтрока, НомерСимвола, 1);		
		Если НомерСимвола = 1 Тогда
			Вгр = КодСимвола(Символ);
			Нгр = КодСимвола(Символ);
		КонецЕсли;
		Если Вгр < КодСимвола(Символ) Тогда
			Вгр = КодСимвола(Символ);
		КонецЕсли;
		Если Нгр > КодСимвола(Символ) Тогда
			Нгр = КодСимвола(Символ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
